"1. Поработайте с переменными, создайте несколько, выведите на экран. Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран."

x = (2 + 3)
print(x)

x = (2 + 3)
print(x)

a = 4
a = a + 1
a = "text"
print(a)

a = 2 + 2
print(a)

name = input("Введите ваше имя: ")
a = int(input("Введите целое число: "))
print("Меня зовут", name, ", мне", a, "лет")

# результат _______
# Введите ваше имя: коля
# Введите целое число: 17
# Меня зовут Петя , мне 17 лет
